select TOP(10) С.Фамилия, С.Имя, С.Отчество, Г.Наименование, cast(AVG(ЗВ.Отметка*1.0) as decimal (3,2)) as [Средний балл]
from dbo.Студенты С inner join dbo.[Студенты в группах] СГ
on С.[ID студента] = СГ.[ID студента]
inner join dbo.Группы Г
on Г.[ID группы] = СГ.[ID группы]
inner join dbo.[Зачетная ведомость] ЗВ
on ЗВ.[ID студента] = СГ.[ID студента] and ЗВ.[ID группы] = СГ.[ID группы]
group by С.Фамилия, С.Имя, С.Отчество, С.[ID студента], Г.Наименование
order by [Средний балл] desc
