SELECT DISTINCT Студенты.Имя, Студенты.Фамилия, Студенты.Фамилия,
CASE 
	WHEN count(case when st2.[Код формы оплаты] <> st1.[Код формы оплаты] then 1 end) = 1 THEN 'Разное'
	ELSE [Формы оплаты].Наименование
	END AS 'Форма оплаты'
FROM [Студенты в группах] st1
INNER JOIN [Студенты в группах] st2 ON st1.[ID студента] = st2.[ID студента]
INNER JOIN [Формы оплаты] ON [Формы оплаты].[Код формы оплаты] = st1.[Код формы оплаты]
INNER JOIN Студенты ON Студенты.[ID студента] = st1.[ID студента]
GROUP BY Студенты.Имя, Студенты.Фамилия, Студенты.Фамилия, [Формы оплаты].Наименование
HAVING COUNT(st1.[ID группы]) > 1

