INSERT INTO [Дисциплина в семестре]([ID лектора], [ID группы], [Код дисциплницы], [Номер семестра обучения],[Количество часов в неделю], [Код формы контроля])
VALUES (
(SELECT [ID Преподавателя]
FROM Преподаватели
WHERE (Фамилия = 'Иванова' AND Имя LIKE 'И%' AND Отчество LIKE 'И%')
),
(SELECT [ID группы]
FROM Группы
WHERE Наименование = '8И42'),
(SELECT [Код дисциплины]
FROM Дисциплины
WHERE Наименование = 'Физика 3.2'),
5, 10,
(SELECT [Код формы контроля]
FROM [Формы контроля]
WHERE Наименование = 'Экзамен')
)